//
//  Data.swift
//  NARUTO
//
//  Created by Kxy on 2018/1/9.
//  Copyright © 2018年 Kxy. All rights reserved.
//

import UIKit

class Datayuan: NSObject {
    var img:String
    var title:String
    var detail:String
    var baike:String
    init(img:String, title:String, detail:String,baike: String) {
        self.img = img
        self.title = title
        self.detail = detail
        self.baike = baike
    }
    
}
//Data(img: "1", title: "佐助", detail: "直巴写轮眼", baike: "宇智波佐助，日本漫画《火影忍者》及其衍生作品中的男二号。火之国木叶隐村宇智波一族的天才忍者，六道仙人长子因陀罗的转世者。年幼时目睹宇智波一族被哥哥宇智波鼬全灭，从而走上复仇之路。在终末之谷与漩涡鸣人展开激战，将鸣人打败后叛离木叶并追随大蛇丸。三年后，佐助将大蛇丸吸收到异空间，并成功向鼬复仇，但在此之后却得知了宇智波鼬的灭族真相，于是决定摧毁木叶。后来，佐助与秽土转生的鼬相遇，想法再次发生了变化，为了进一步了解忍者、家族、哥哥的过去，佐助与秽土转生的历代火影进行交谈，在听完他们的回答后决定继承鼬的意志守护木叶，并希望成为火影改变木叶的忍者体制。第四次忍界大战结束后，佐助因对于维护世界和平的道路选择和鸣人不同，而在终结之谷与鸣人进行了最后一战，结果两人各断一条手臂。最终佐助被鸣人感化，认同了鸣人的道路，并重新成为木叶的一员。"), Data(img: "2", title: "人柱力", detail: "尾兽", baike: "“人柱力”是在日本漫画火影忍者（NARUTO）中出现的名词“じんちゅうりき”的当用汉字。所谓人柱力，即被尾兽或者尾兽查克拉附身的人，作为封印尾兽或其查克拉的容器的存在。以尾兽化和利用尾兽查克拉作为独有的攻击手段。（金角银角被后世称为人柱力，也有人模仿金角银角吃八尾的触角（布瑠比生前就是八尾人柱力所以秽土后可以使用八尾牛角培养的查克拉进行尾兽化），却没有成为人柱力都失败了；其中也有仿人柱力，火之寺的空就是仿人柱力，仿人柱力是将一点尾兽查克拉封印在目标体内随着时间慢慢提升尾兽查克拉）。"),Data(img: "3", title: "带土", detail: "面具男", baike: "宇智波带土，日本动漫《火影忍者》中的重要人物。火之国木叶村的宇智波一族成员，擅长使用时空间忍术“神威”、宇智波禁术、阴阳遁术等技能，他的故事可以说贯穿了整部火影的主线。神无毗桥之战被岩石压中处于濒死状态，将左眼和守护暗恋的女孩野原琳的愿望一同托付给于挚友旗木卡卡西。后在宇智波一族前任首领宇智波斑的阴谋下，带土目睹了野原琳死亡后痛不欲生，认识到战争的残酷，从此堕入黑暗，成为“晓”的实际操纵者，曾协助宇智波鼬参与灭族行动，并和药师兜发动了第四次忍界大战，更成为忍界第二位十尾人柱力。在第四次忍界大战中与漩涡鸣人的战斗中被逐渐感化，想起自己有着曾经保护同伴的梦想。后帮助第七班的成员与大筒木辉夜进行了异空间对决，在替鸣人和卡卡西挡下了辉夜的共杀灰骨后壮烈牺牲，但剩下的查克拉仍在最后一刻帮助第七班他们战胜了大筒木辉夜。最终带土将最后的写轮眼托付给卡卡西后， 毫无遗憾的和琳前往了另一个世界。"),Data(img: "4", title: "自来也", detail: "木叶三忍", baike: "自来也，日本漫画《火影忍者》及其衍生作品中的虚拟角色。火之国木叶隐村的“三忍”之一，三代火影猿飞日斩的弟子，四代目火影波风水门、长门、弥彦、小南、七代目火影漩涡鸣人的师父。他指导鸣人修行，在鸣人成长的道路上有着重要的作用。后到雨忍村刺探情报，结果不幸死于“晓”首领佩恩之手。"),Data(img: "5", title: "宇智波鼬", detail: "永远是木叶的宇智波鼬", baike: "宇智波鼬，日本动漫《火影忍者》中的重要人物。火之国木叶隐村宇智波一族的成员，宇智波佐助的哥哥。是宇智波一族的天才忍者，年幼时跟宇智波止水是挚友，实力强大，擅长使用幻术。为了保护村子免受战乱，被迫接受了灭族任务，留下了弟弟佐助并刺激他向自己复仇，之后加入晓组织做卧底。最终在与弟弟宇智波佐助的战斗中为佐助注入瞳力后，因身体患有不治之症，体力不支而死亡。第四次忍界大战中被药师兜以秽土转生形式复活，在和漩涡鸣人与奇拉比的战斗中由于使用了万花筒写轮眼，触发了原本留给鸣人体内装有止水左眼的乌鸦并对鼬使用了别天神，从而让鼬摆脱秽土转生的控制，后与佐助合力击败药师兜，最终秽土转生解除后，灵魂升天。"),Data(img: "6", title: "贝吉塔", detail: "魔人状态", baike: "贝吉塔，日本动漫《龙珠》系列中的主要角色之一。是战斗民族赛亚人的王子，拥有极高的自尊心。过去贝吉塔行星被弗利萨破坏后（不知情，一直以为是被陨石撞击而毁灭。）以前在弗利萨军团那儿做事。初登场时是个侵略地球的反派角色，后被孙悟空（赛亚人卡卡罗特）等人打败。弗利萨一战结束后听说悟空成为超级赛亚人，于是决定以超越悟空为目标，一直留在地球上努力修行。多次和悟空保护地球。在人造人篇中学会了超级赛亚人变身，起初只是想着超越悟空才呆在地球，后来有了家人后慢慢的爱上了这颗星球，在与布欧一战中为了保护地球决定以自爆与布欧同归于尽。后复活为悟空制造元气弹争取时间，击败布欧后仍为了超越悟空而努力修行。"),Data(img: "7", title: "孙悟空", detail: "超蓝超级赛亚人", baike: "孙悟空在经历了破坏神比鲁斯之战后，便和贝吉塔一起去维斯那里进行严格的修炼，掌握了超越超级赛亚人之神的超级赛亚人的变身。超级赛亚人之神超级赛亚人是超赛神之上的境界，力量经过强化升华后进阶的超级赛亚人新形态，其实力全面超越了超级赛亚人之神。这一形态首次出现在剧场版《龙珠Z：复活的F》中，在《龙珠超》漫画和动画中多次出现，并衍生出多种强化形态。"),Data(img: "8", title: "孙悟空", detail: "超级赛亚人2", baike: "超级赛亚人2是日本动漫《七龙珠》里赛亚人的一种变身形态，首次出现于《龙珠Z》第184集 十六号的悲惨下场 悟饭的愤怒爆发了[1]  。（注：贝吉塔的超一第二阶段不是超二，只是超越超级赛亚人的水平）。曾经变身此形态的变身者：孙悟饭、孙悟空、贝吉塔、未来特兰克斯、卡莉芙拉、加贝、开芙拉。")]

